Revit 2026 API

# SweepProfileSymbol Property

---

The family symbol profile details for the sweep.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbolProfile ProfileSymbol { get; }
```
```vb
Public ReadOnly Property ProfileSymbol As FamilySymbolProfile
	Get
```
```cpp
public:
property FamilySymbolProfile^ ProfileSymbol {
	FamilySymbolProfile^ get ();
}
```
```fsharp
member ProfileSymbol : FamilySymbolProfile with get
```

#### Property Value

FamilySymbolProfile

If the profile is not based on a profile family, this property is .

#### Reference

Sweep Class

Autodesk.Revit.DB Namespace